---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewDependency
source: html/3e7b8773-eb2b-5bdb-cc35-37ee992f988c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewDependency Property

"Dependency"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewDependency { get; }
```